DataFrame

Question1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column(instead of a float column).

In [87]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
df#intering the dataframe

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [77]:
df['FlightNumber'][1]=10055.0#replacing the value
df['FlightNumber'][3]=10075.0

C:\Users\Amol\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Amol\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [78]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [79]:
import pandas as pd
df['FlightNumber'].astype(int)
df#changing the datatype to int

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

Question2:The From_To column would be better as two separate columns! Split eachstring on the underscore delimiter _ to give a new temporary DataFrame withthe correct values. Assign the correct column names to this temporary DataFrame.

In [80]:
df['From'] = df['From_To'].str.split('_').str[0]#spliting first part
df['To']=df['From_To'].str.split('_').str[1]#spliting second part
df.drop('From_To',axis=1,inplace=True)
df.set_index(['From',"To"])

                    FlightNumber  RecentDelays              Airline
From     To
LoNDon   paris           10045.0      [23, 47]               KLM(!)
MAdrid   miLAN           10055.0            []    <Air France> (12)
londON   StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
Budapest PaRis           10075.0          [13]       12. Air France
Brussels londOn          10085.0      [67, 32]          "Swiss Air"

Question3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [82]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
df#intering the dataframe

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [83]:
df['From_To']=df['From_To'].str.capitalize()
df#capitilizing first letter of column From_To

            From_To  FlightNumber  RecentDelays              Airline
0      London_paris       10045.0      [23, 47]               KLM(!)
1      Madrid_milan           NaN            []    <Air France> (12)
2  London_stockholm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_paris           NaN          [13]       12. Air France
4   Brussels_london       10085.0      [67, 32]          "Swiss Air"

Questio4: Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [84]:
df.drop('From_To',axis=1)

   FlightNumber  RecentDelays              Airline
0       10045.0      [23, 47]               KLM(!)
1           NaN            []    <Air France> (12)
2       10065.0  [24, 43, 87]  (British Airways. )
3           NaN          [13]       12. Air France
4       10085.0      [67, 32]          "Swiss Air"

5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [86]:
df['RecentDelays']=pd.DataFrame(df['RecentDelays'])
df['RecentDelays']
df[['delay_1','delay_2','delay_3']] = pd.DataFrame(df['RecentDelays'].tolist(), index= df.index)
df.drop('RecentDelays',axis=1,inplace=True)
print(df)

            From_To  FlightNumber              Airline  delay_1  delay_2  \
0      London_paris       10045.0               KLM(!)     23.0     47.0
1      Madrid_milan           NaN    <Air France> (12)      NaN      NaN
2  London_stockholm       10065.0  (British Airways. )     24.0     43.0
3    Budapest_paris           NaN       12. Air France     13.0      NaN
4   Brussels_london       10085.0          "Swiss Air"     67.0     32.0

   delay_3
0      NaN
1      NaN
2     87.0
3      NaN
4      NaN